import types from 'Root/redux/actions';

/* eslint-disable */
const sampleData = [
    {
        "id": "1a1sda4gfskvln34",
        "likes": 25,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545460200000,
        "status": "در حال نمایش",
        "creator": {
            "id": "qetuwryipadsgj12",
            "firstname": "علیرضا",
            "lastname": "عربی",
            "nationalId": "aabbccdd12"
        }
    },
    {
        "id": "1a1sda4gfskvln35",
        "likes": 35,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545461200000,
        "status": "در حال نمایش",
        "creator": {
            "id": "qetuwryipadsgj13",
            "firstname": "کیانا",
            "lastname": "لشکری",
            "nationalId": "aabbccdd13"
        }
    },
    {
        "id": "1a1sda4gfskvln36",
        "likes": 35,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545458200000,
        "status": "در حال نمایش",
        "creator": {
            "id": "qetuwryipadsgj14",
            "firstname": "مینا",
            "lastname": "محمدی",
            "nationalId": "aabbccdd14"
        }
    },
    {
        "id": "1a1sda4gfskvln37",
        "likes": 65,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545459200000,
        "status": "گزارش شده",
        "creator": {
            "id": "qetuwryipadsgj15",
            "firstname": "محمد",
            "lastname": "معتظمی",
            "nationalId": "aabbccdd15"
        }
    },
    {
        "id": "1a1sda4gfskvln38",
        "likes": 13,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545454700000,
        "status": "در حال نمایش",
        "creator": {
            "id": "qetuwryipadsgj15",
            "firstname": "محمود",
            "lastname": "احمدی‌نژاد",
            "nationalId": "aabbccdd15"
        }
    },
    {
        "id": "1a1sda4gfskvln39",
        "likes": 22,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545460000000,
        "status": "در حال نمایش",
        "creator": {
            "id": "qetuwryipadsgj16",
            "firstname": "محمود",
            "lastname": "قلی‌پور",
            "nationalId": "aabbccdd16"
        }
    },
    {
        "id": "1a1sda4gfskvln40",
        "likes": 40,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545461100000,
        "status": "گزارش شده",
        "creator": {
            "id": "qetuwryipadsgj17",
            "firstname": "علی",
            "lastname": "کریمی",
            "nationalId": "aabbccdd17"
        }
    },
    {
        "id": "1a1sda4gfskvln41",
        "likes": 40,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545461200000,
        "status": "گزارش شده",
        "creator": {
            "id": "qetuwryipadsgj18",
            "firstname": "فرشاد",
            "lastname": "احمدزاده",
            "nationalId": "aabbccdd18"
        }
    },
    {
        "id": "1a1sda4gfskvln42",
        "likes": 40,
        "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        "date": 1545461200000,
        "status": "گزارش شده",
        "creator": {
            "id": "qetuwryipadsgj19",
            "firstname": "سینا",
            "lastname": "حجازی",
            "nationalId": "aabbccdd19"
        }
    }
]

/* eslint-enable */

const initialState = [];

export default function (state = initialState, action) {
  switch (action.type) {
    case types.suggestionOrgA.LOAD: {
      return sampleData;
    }

    default: {
      return state;
    }
  }
}
