import types from 'Root/redux/actions';

/* eslint-disable */
const sampleData = [
    {
        "id": "1a1sda4gfskvln34",
        "firstname": "علیرضا",
        "lastname": "عربی",
        "suggestion": {
            "likes": 25,
            "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
            "date": 1545460200000,
            "status": "در حال نمایش"
        }
    },
    {
        "id": "1a1sda4gfskvln35",
        "firstname": "علی",
        "lastname": "موحدی",
        "suggestion": {
            "likes": 35,
            "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
            "date": 1545440200000,
            "status": "در حال نمایش"
        }
    },
    {
        "id": "1a1sda4gfskvln36",
        "firstname": "مینا",
        "lastname": "میرزاخانی",
        "suggestion": {
            "likes": 45,
            "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
            "date": 1545360200000,
            "status": "گزارش شده"
        }
    },
    {
        "id": "1a1sda4gfskvln37",
        "firstname": "محمدرضا",
        "lastname": "خانلری‌زاده",
        "suggestion": {
            "likes": 23,
            "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
            "date": 1545440100000,
            "status": "در حال نمایش"
        }
    },
    {
        "id": "1a1sda4gfskvln38",
        "firstname": "حسام",
        "lastname": "حیدرزاده",
        "suggestion": {
            "likes": 16,
            "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
            "date": 1545330200000,
            "status": "در حال نمایش"
        }
    },
    {
        "id": "1a1sda4gfskvln39",
        "firstname": "کیمیا",
        "lastname": "مبشری‌زاده",
        "suggestion": {
            "likes": 22,
            "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
            "date": 1545350200000,
            "status": "گزارش شده"
        }
    },
    {
        "id": "1a1sda4gfskvln40",
        "firstname": "کیانا",
        "lastname": "لشکری",
        "suggestion": {
            "likes": 25,
            "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
            "date": 1545350200000,
            "status": "در حال نمایش"
        }
    },
    {
        "id": "1a1sda4gfskvln41",
        "firstname": "محمدعلی",
        "lastname": "جناح",
        "suggestion": {
            "likes": 21,
            "text": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
            "date": 1545380200000,
            "status": "در حال نمایش"
        }
    }
]

/* eslint-enable */

const initialState = [];

export default function (state = initialState, action) {
  switch (action.type) {
    case types.suggestionOrgA.LOAD: {
      return sampleData;
    }

    default: {
      return state;
    }
  }
}
